NSCameraUsageDescription = "Teastaíonn rochtain ceamara chun doiciméid a scanadh agus grianghraf agus físeán a dhéanamh.";
NSFaceIDUsageDescription = "Teastaíonn aitheantas aghaidhe chun aitheantas aghaidhe a fhíordheimhniú.";
NSLocationAlwaysUsageDescription = "The app uses your location to automatically trigger file uploads when you move between areas.";
NSPhotoLibraryUsageDescription = "Tá rochtain ar leabharlann grianghraf ag teastáil chun do ghrianghraif agus físeáin a uaslódáil chuig do scamall.";
NSPhotoLibraryAddUsageDescription = "Tá rochtain ar leabharlann grianghraf ag teastáil chun do ghrianghraif agus físeáin a uaslódáil chuig do scamall.";
NSMicrophoneUsageDescription = "Teastaíonn rochtain ar mhicreafón chun nótaí gutha a chruthú.";
NSLocationWhenInUseUsageDescription = "This app uses your location to detect movement and automatically upload files. It does not use GPS and does not store your location.";
NSLocationAlwaysAndWhenInUseUsageDescription = "This app needs access to your location even in the background to automatically start uploading files when significant movement is detected. GPS is not used.";
